app/controllers/lists_controller.rb

INSERT INTO "lists" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "ergferg"], ["created_at", "2023-11-17 10:24:18.645396"], ["updated_at", "2023-11-17 10:24:18.645396"]]
---
  def create
    @list = List.new(list_params)
      if @list.save